<a href="https://colab.research.google.com/github/IBoutbaoucht/IBoutbaoucht/blob/main/SQL_lab_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# SQL with Python
This lab introduces SQL using Python and SQLite, a lightweight database system. You will learn how to:
- Connect to an SQLite database.
- Create tables and insert data.
- Perform batch data insertion.
- Query the database.

SQLite is ideal for learning as it requires no additional setup and comes pre-installed with Python.

## Install and Import Dependencies
SQLite is included with Python, so no additional installation is required. However, we'll use pandas for CSV manipulation.

In [ ]:
import sqlite3
import pandas as pd
import os

## Connect to SQLite Database
We'll create or connect to an SQLite database file named `lab_2.db`. If the file doesn't exist, SQLite will create it.

In [ ]:
# remove existing db
if "lab_2.db" in os.listdir():
  os.remove("lab_2.db")

# Connect to SQLite database
connection = sqlite3.connect("lab_2.db")

# Create a cursor object to execute SQL commands
cursor = connection.cursor()

print("Database connection established.")

Database connection established.

## Creating a Table
We'll create a table called `Students` with the following schema:
- `ID`: INTEGER, Primary Key
- `Name`: TEXT
- `Age`: INTEGER
- `Grade`: TEXT

In [ ]:
# Create a table
create_table_query = '''
CREATE TABLE IF NOT EXISTS Students (
    ID INTEGER PRIMARY KEY,
    Name TEXT,
    Age INTEGER,
    Grade TEXT
);
'''
cursor.execute(create_table_query)
connection.commit()

print("Table 'Students' created successfully.")

Table 'Students' created successfully.

## Inserting Data
Insert a few records into the `Students` table.

In [ ]:

insert_query = '''
INSERT INTO Students (Name, Age, Grade)
VALUES (?, ?, ?);
'''

# data
students_data = [
    ('Alice', 20, 'A'),
    ('Bob', 22, 'B'),
    ('Charlie', 21, 'A'),
]


cursor.executemany(insert_query, students_data)
connection.commit()

print("Records inserted successfully.")

Records inserted successfully.

## Querying Data
Use SQL SELECT queries to retrieve data from the `Students` table.

In [ ]:
# Retrieve data
query = "SELECT * FROM Students;"
cursor.execute(query)

# Fetch and display results
results = cursor.fetchall()
for row in results:
    print(row)

(1, 'Alice', 20, 'A')
(2, 'Bob', 22, 'B')
(3, 'Charlie', 21, 'A')

## Batch Insertion
We will load data into a new table named `Employees`.
The should contain the following columns:
- `ID` (INTEGER)
- `Name` (TEXT)
- `Position` (TEXT)
- `Salary` (REAL)

Let's create the `Employees` table and write data to table .

In [ ]:
# Create Employees table
create_employees_table = '''
CREATE TABLE IF NOT EXISTS Employees (
    ID INTEGER PRIMARY KEY,
    Name TEXT,
    Position TEXT,
    Salary REAL
);
'''
cursor.execute(create_employees_table)

#data
csv_data = [
    (1, 'John Doe', 'Manager', 75000.0),
    (2, 'Jane Smith', 'Developer', 65000.0),
    (3, 'Emily Davis', 'Designer', 50000.0),
]

# Insert data into Employees table
insert_employees_query = '''
INSERT INTO Employees (ID, Name, Position, Salary)
VALUES (?, ?, ?, ?);
'''

cursor.executemany(insert_employees_query, csv_data)
connection.commit()

print("Data loaded from CSV and inserted into 'Employees' table.")

Data loaded from CSV and inserted into 'Employees' table.

## Query Examples
Let's perform some queries:
1. Retrieve all employees earning more than $60,000.
2. Count the number of employees.

In [ ]:
# Query: Employees earning more than $60,000
query_high_salary = "SELECT * FROM Employees WHERE Salary > 60000;"
cursor.execute(query_high_salary)
# we use fetch all when we have multiple rows as output
high_salary_employees = cursor.fetchall()
print("Employees earning more than $60,000:")
for emp in high_salary_employees:
    print(emp)

# Query: Count the number of employees
query_count = "SELECT COUNT(*) FROM Employees;"
cursor.execute(query_count)
# we use fetch all when we have multiple rows as output
employee_count = cursor.fetchone()[0]
print(f"Total number of employees: {employee_count}")

Employees earning more than $60,000:
(1, 'John Doe', 'Manager', 75000.0)
(2, 'Jane Smith', 'Developer', 65000.0)
Total number of employees: 3

## Closing the Database Connection
Always close the database connection when you're done to ensure data integrity.

In [ ]:
# Close the connection
connection.close()
print("Database connection closed.")

Database connection closed.

# It is your turn !
## **Lab: Transform ER Diagram seen in Exercise 2.3 into SQL Tables**

### **Objective**
The goal of this lab is to transform the given ER diagram into SQL tables, populate the tables with sample data, and write SQL queries to answer specific questions.

---

### **Instructions**


1. **Create SQL Tables**  
   - Use `CREATE TABLE` statements to define tables for each entity and relationship.  
   - Ensure proper use of primary keys, foreign keys, and data types.

2. **Insert Sample Data**  
   - Populate each table with at least 5–10 rows of sample data.

3. **Write SQL Queries**  
   - Use SQL queries to answer the provided questions.

---

### **Questions**

1. **List all professors and their research specialties.**  

2. **Retrieve all projects managed by a specific professor.**  

3. **Find the names of graduate students working on a specific project.**  

4. **Find professors supervising graduate students on a specific project.**  

5. **Count how many professors work in each department.**  

6. **List graduate students and their advisors.**  

7. **Find all projects with a budget greater than $1,000,000.**  

8. **Retrieve all departments and their chairmen.**  

9. **Find the total number of projects a specific professor is managing.**  

10. **Find the names of graduate students and their major department.**

In [ ]:
import sqlite3
import pandas as pd
import os

In [ ]:
connection = sqlite3.connect("University_Database.db")
cursor = connection.cursor()

In [ ]:


professor_Table_Query = ''' CREATE TABLE IF NOT EXISTS Professor (
  SSN INTEGER PRIMARY KEY ,
  AGE INT,
   SPECIALITY TEXT,
   RANK TEXT) ;'''
cursor.execute(professor_Table_Query)

Departement_Table_Query = ''' CREATE TABLE IF NOT EXISTS Departement (
  DNO INTEGER PRIMARY KEY ,
  DNAME TEXT,
  OFFICE TEXT,
  Departement_Manager_SSN INTEGER,
  FOREIGN KEY (Departement_Manager_SSN) REFERENCES Professor(SSN)
  ) ;'''
cursor.execute(Departement_Table_Query)


WORK_Relation_Query = ''' CREATE TABLE IF NOT EXISTS Work_dept (
    DNO INTEGER NOT NULL ,
    SSN INTEGER,
    pc_time INTEGER,
    PRIMARY KEY (DNO,SSN),
    FOREIGN KEY  (DNO) REFERENCES Departement(DNO),
    FOREIGN KEY (SSN) REFERENCES Professor (SSN)
    ) ;'''
cursor.execute(WORK_Relation_Query)

Project_Table_Query = ''' CREATE TABLE IF NOT EXISTS Project (
  PID INTEGER PRIMARY KEY ,
  BUDGET INT,
  SPONSOR TEXT,
  START_DATE TEXT,
  END_DATE TEXT ,
  Manager_SSN INTEGER,
  FOREIGN KEY (Manager_SSN) REFERENCES Professor(SSN) ) ;'''
cursor.execute(Project_Table_Query)


Professor_Project_Relation_Query = ''' CREATE TABLE IF NOT EXISTS Professor_Project (
    PID INTEGER  ,
    SSN INTEGER NOT NULL,
    PRIMARY KEY (PID,SSN),
    FOREIGN KEY  (PID) REFERENCES Project(PID),
    FOREIGN KEY (SSN) REFERENCES Professor (SSN)
    ) ;'''
cursor.execute(Professor_Project_Relation_Query)


Graduate_Table_Query = ''' CREATE TABLE IF NOT EXISTS Graduate (
  SSN INTEGER PRIMARY KEY ,
  NAME TEXT,
  AGE INT,
  DEG_PROG TEXT,
  SENIOR_SSN INTEGER  ,
  Major INT ,
  FOREIGN KEY  (SENIOR_SSN) REFERENCES Graduate(SSN),
  FOREIGN KEY  (Major) REFERENCES Departement(DNO)


  ) ;'''
cursor.execute(Graduate_Table_Query)


GRADUATE_Project_Relation_Query = ''' CREATE TABLE IF NOT EXISTS GRADUATE_Project (
    PID INTEGER  ,
    GRADUATE_SSN INTEGER NOT NULL ,
    FOREIGN KEY  (PID) REFERENCES Project(PID),
    FOREIGN KEY (GRADUATE_SSN) REFERENCES Graduate(SSN)
    ) ;'''
cursor.execute(GRADUATE_Project_Relation_Query)





connection.commit()

print("Successful")

Successful

In [ ]:
Insert_Professor = ''' INSERT INTO Professor (SSN, AGE, SPECIALITY, RANK) VALUES
(1, 45, 'Artificial Intelligence', 'Professor'),
(2, 50, 'Data Science', 'Professor'),
(3, 40, 'Cybersecurity', 'Associate Professor'),
(4, 38, 'Software Engineering', 'Assistant Professor');

'''
Insert_Departement  = '''
INSERT INTO Departement (DNO, DNAME, OFFICE, Departement_Manager_SSN) VALUES
(101, 'Computer Science', 'Building A - Room 101', 1),
(102, 'Information Systems', 'Building B - Room 202', 2),
(103, 'Cybersecurity', 'Building C - Room 303', 3);

'''

Insert_Work_dept  = '''
INSERT INTO Work_dept (DNO, SSN, pc_time) VALUES
(101, 1, 30),
(102, 2, 25),
(103, 3, 40),
(101, 4, 15);
'''

Insert_Departement  = '''
INSERT INTO Project (PID, BUDGET, SPONSOR, START_DATE, END_DATE, Manager_SSN) VALUES
(201, 50000, 'TechCorp', '2024-01-01', '2024-06-30', 1),
(202, 75000, 'DataInc', '2024-02-01', '2024-08-31', 2),
(203, 100000, 'CyberSecurity Org', '2024-03-01', '2024-12-31', 3);

'''

Insert_Professor_Project   = '''
INSERT INTO Professor_Project (PID, SSN) VALUES
(201, 1),
(202, 2),
(203, 3),
(201, 4);


'''


Insert_Graduate  = '''
INSERT INTO Graduate (SSN, NAME, AGE, DEG_PROG, SENIOR_SSN, Major) VALUES
(1001, 'Alice', 22, 'Computer Science', NULL, 101),
(1002, 'Bob', 23, 'Data Science', 1001, 102),
(1003, 'Charlie', 21, 'Cybersecurity', NULL, 103),
(1004, 'Diana', 22, 'Software Engineering', 1001, 101);

'''

Insert_GRADUATE_Project  = '''
INSERT INTO GRADUATE_Project (PID, GRADUATE_SSN) VALUES
(201, 1001),
(202, 1002),
(203, 1003),
(201, 1004);


'''